apache/nuttx/arch/arm/include/sam34/chip.h
/************************************************************************************
 * arch/arm/include/sam34/chip.h
 *
 *   Copyright (C) 2009-2010, 2013 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_INCLUDE_SAM34_CHIP_H
#define __ARCH_ARM_INCLUDE_SAM34_CHIP_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Get customizations for each supported chip */

/* AT91SAM3U Family *****************************************************************/
/* FEATURE      SAM3U4E  SAM3U2E  SAM3U1E  SAM3U4C  SAM3U2C  SAM3U1C
 * ----------- -------- -------- -------- -------- -------- --------
 * Flash        2x128KB  128KB    64KB     2x128KB  128KB    64KB
 * SRAM         32+16KB  16+16KB  16KB     32+16KB  16+16KB  16KB
 * NFC          Yes      Yes      Yes      Yes      Yes      Yes
 * NFC SRAM     4KB      4KB      4KB      4KB      4KB      4KB
 * Package      LQFP144  LQFP144  LQFP144  LQFP100  LQFP100  LQFP100
 *              LFBGA144 LFBGA144 LFBGA144 LFBGA100 LFBGA100 LFBGA100
 * No. PIOs     96       96       96       57       57       57
 * SHDN Pin     Yes      Yes      Yes      No       No       No
 * EMAC         ---      ---      ---      ---      ---      ---
 * EBI          Yes      Yes      Yes      Yes      Yes      Yes
 * EBI data     8/16     8/16     8/16     8        8        8
 * EBI ch       4        4        4        2        2        2
 * EBI addr     24       24       24       8        8        8
 * SDRAM        ---      ---      ---      ---      ---      ---
 * DMA          4        4        4        4        4        4
 * 12-bit ADC   8ch      8ch      8ch      4ch      4ch      4ch
 * 10-bit ADC   8ch      8ch      8ch      4ch      4ch      4ch
 * 32-bit Timer 1        1        1        1        1        1
 * 16-bit Timer 3        3        3        3        3        3
 * PDC Channels 17       17       17       17       17       17
 * USART        4        4        4        3        3        3
 * UART         2        2        2        1        1        1
 * SPI          1        1        1        1        1        1
 * SSC          1        1        1        1        1        1
 * HSMCI        8 bit    8 bit    8 bit    4 bit    4 bit    4 bit
 */

#if defined(CONFIG_ARCH_CHIP_ATSAM3U4E)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           (16*1024)     /*  16KB */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3U2E)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM0_SIZE           (16*1024)     /*  16KB */
#  define SAM34_SRAM1_SIZE           (16*1024)     /*  16KB */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3U1E)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (64*1024)     /*  64KB */
#  define SAM34_SRAM0_SIZE           (16*1024)     /*  16KB */
#  define SAM34_SRAM1_SIZE           0             /*  No SRAM1 */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3U4C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           (16*1024)     /*  16KB */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3U2C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM0_SIZE           (16*1024)     /*  16KB */
#  define SAM34_SRAM1_SIZE           (16*1024)     /*  16KB */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

