apache/nuttx/arch/arm/include/sam34/chip.h
#elif defined(CONFIG_ARCH_CHIP_ATSAM3U1C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (64*1024)     /*  64KB */
#  define SAM34_SRAM0_SIZE           (16*1024)     /*  16KB */
#  define SAM34_SRAM1_SIZE           0             /*  No SRAM1 */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

/* AT91SAM3X/3A Families ************************************************************/
/* FEATURE      SAM3X8E  SAM3X8C  SAM3X4E  SAM3X4C  SAM3A8C  SAM3A4C
 * ------------ -------- -------- -------- -------- -------- --------
 * Flash        2x256KB  2x256KB  2x128KB  2x128KB  2x256KB  2x128KB
 * SRAM         64+32KB  64+32KB  32+32KB  32+32KB  64+32KB  32+32KB
 * NFC          Yes      ---      Yes      ---      ---      ---
 * NFC SRAM     4KB      ---      4KB      ---      ---      ---
 * Package      LQFP144  LQFP100  LQFP144  LQFP100  LQFP100  LQFP100
 *              LFBGA144 LFBGA100 LFBGA144 LFBGA100 LFBGA100 LFBGA100
 * No. PIOs     103      63       103      63       63       63
 * SHDN Pin     Yes      No       Yes      No       No       No
 * EMAC         MII/RMII RMII     MII/RMII RMII     ---      ---
 * EBI          Yes      ---      Yes      ---      ---      ---
 * SDRAM        ---      ---      ---      ---      ---      ---
 * DMA          6        4        6        4        4        4
 * 12-bit ADC   16ch     16ch     16ch     16ch     16ch     16ch
 * 12-bit DAC   2ch      2ch      2ch      2ch      2ch      2ch
 * 32-bit Timer 9        9        9        9        9        9
 * PDC Channels 17       17       17       15       15       15
 * USART        3        3        3        3        3        3
 * UART         2        1        2        1        1        1
 * SPI          1/4+3    1/4+3    1/4+3    1/4+3    1/4+3    1/4+3
 * HSMCI        8 bit    4 bit    8 bit    4 bit    4 bit    4 bit
 */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3X8E)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (512*1024)    /* 512KB */
#  define SAM34_SRAM0_SIZE           (64*1024)     /*  64KB */
#  define SAM34_SRAM1_SIZE           (32*1024)     /*  32KB */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              6            /* 6 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                1            /* One USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3X8C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (512*1024)    /* 512KB */
#  define SAM34_SRAM0_SIZE           (64*1024)     /*  64KB */
#  define SAM34_SRAM1_SIZE           (32*1024)     /*  32KB */
#  define SAM34_NFCSRAM_SIZE         0             /* No NFC SRAM */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                1            /* One USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3X4E)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           (32*1024)     /*  32KB */
#  define SAM34_NFCSRAM_SIZE         (4*1024)      /*   4KB */

/* Peripherals */

#  define SAM34_NDMACHAN              6            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              17           /* 17 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                1            /* One USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3X4C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           (32*1024)     /*  32KB */
#  define SAM34_NFCSRAM_SIZE         0             /* No NFC SRAM */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              15           /* 15 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                1            /* One USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3A8C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (512*1024)    /* 512KB */
#  define SAM34_SRAM0_SIZE           (64*1024)     /*  64KB */
#  define SAM34_SRAM1_SIZE           (32*1024)     /*  32KB */
#  define SAM34_NFCSRAM_SIZE         0             /* No NFC SRAM */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              15           /* 15 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                1            /* One USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM3A4C)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  64KB */
#  define SAM34_SRAM1_SIZE           (32*1024)     /*  32KB */
#  define SAM34_NFCSRAM_SIZE         0             /* No NFC SRAM */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMA Channels */
#  define SAM34_NPDCCHAN              15           /* 15 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                1            /* One USB high speed device */
#  define SAM34_NUHPHS                1            /* One USB high speed embedded host */
#  define SAM34_NUDPFS                0            /* No USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

/* AT91SAM4L Family *****************************************************************/
/* Sub-family differences:
 *
 *   FEATURE                 ATSAM4LCxx    ATSAM4LSxx
 *   ----------------------- ------------- -------------
 *   SEGMENT LCD             Yes           No
 *   AESA                    Yes           No
 *   USB                     Device + Host Device Only
 *
 *   Note:  The SEGMENT LCD capability varies with packaging.
 *
 *   FEATURE                 ATSAM4Lx2x    ATSAM4Lx4x
 *   ----------------------- ------------- -------------
 *   FLASH                   256KB         128KB
 *   SRAM                    32KB          32KB
 *
 * Packaging differences:
 *
 *   FEATURE                 ATSAM4LxxC ATSAM4LxxB ATSAM4LxxA
 *   ----------------------- ---------- ---------- ----------
 *   Number of Pins          100        64         48
 *   Max Frequency           48MHz      48MHz      48MHz
 *   SEGMENT LCD             4x40       4x23       4x13
 *   GPIO                    75         43         27
 *   High-drive pins         6          3          1
 *   External Interrupts     8+NMI      8+NMI      8+NMI
 *   TWI Masters             2          2          1
 *   TWI Master/Slave        2          2          1
 *   USART                   4          4          3
 *   PICOUART                1          1          1
 *   Peripheral DMA Channels 16         16         16
 *   Peripheral Even System  1          1          1
 *   SPI                     1          1          1
 *   Asynchronous Timers     1          1          1
 *   Timer/Counter Channels  6          3          3
 *   Parallel Capture Inputs 8          8          8
 *   Frequency Meter         1          1          1
 *   Watchdog Timer          1          1          1
 *   Power Manager           1          1          1
 *   Glue Logic LUT          2          2          1
 *   ADC                     15-channel 7-channel  3-channel
 *   DAC                     1-channel  1-channel  1-channel
 *   Analog Comparators      4          2          1
 *   CATB Sensors            32         32         26
 *   Audio Bitstream DAC     1          1          1
 *   IIS Controller          1          1          1
 *   Packages                TQFP/VFBGA TQFP/QFN   TQFP/QFN
 */

