apache/nuttx/arch/arm/include/sam34/chip.h
#elif defined(CONFIG_ARCH_CHIP_ATSAM4LC2C) || defined (CONFIG_ARCH_CHIP_ATSAM4LC2B) || \
      defined(CONFIG_ARCH_CHIP_ATSAM4LC2A)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              0            /* No DMAC Channels */
#  define SAM34_NPDCCHAN              16           /* 16 PDC Channels */
#  define SAM34_NMCI2                 0            /* No memory card interface */
#  define SAM34_NSLCD                 1            /* 1 segment LCD interface */
#  define SAM34_NAESA                 1            /* 1 advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                1            /* 1 USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM4LC4C) || defined (CONFIG_ARCH_CHIP_ATSAM4LC4B) || \
      defined(CONFIG_ARCH_CHIP_ATSAM4LC4A)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              0            /* No DMAC Channels */
#  define SAM34_NPDCCHAN              16           /* 16 PDC Channels */
#  define SAM34_NMCI2                 0            /* No memory card interface */
#  define SAM34_NSLCD                 1            /* 1 segment LCD interface */
#  define SAM34_NAESA                 1            /* 1 advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                1            /* 1 USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM4LS2C) || defined (CONFIG_ARCH_CHIP_ATSAM4LS2B) || \
      defined(CONFIG_ARCH_CHIP_ATSAM4LS2A)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              0            /* No DMAC Channels */
#  define SAM34_NPDCCHAN              16           /* 16 PDC Channels */
#  define SAM34_NMCI2                 0            /* No memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM4LS4C) || defined (CONFIG_ARCH_CHIP_ATSAM4LS4B) || \
      defined(CONFIG_ARCH_CHIP_ATSAM4LS4A)

/* Internal memory */

#  define SAM34_FLASH_SIZE           (256*1024)    /* 256KB */
#  define SAM34_SRAM0_SIZE           (32*1024)     /*  32KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              0            /* No DMAC Channels */
#  define SAM34_NPDCCHAN              16           /* 16 PDC Channels */
#  define SAM34_NMCI2                 0            /* No memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

/* AT91SAM4S Family *****************************************************************/
/*
 * FEATURE       SAM4SD32C SAM4SD32B SAM4SD16C SAM4SD16B SAM4SA16C SAM4SA16B SAM4S16C SAM4S16B SAM4S8C SAM4S8B
 * ------------- --------- --------- --------- --------- --------- --------- -------- -------- ------- -------
 * Flash         2x1MB     2x1MB     2x512KB   1x1MB     1x1MB     1x1MB     1x1MB    1x1MB    1x512KB 1x512KB
 * SRAM          160KB     160KB     160KB     160KB     160KB     160KB     128KB    128KB    128KB   128KB
 * HCACHE        2KB       2KB       2KB       2KB       2KB       2KB       -        -        -       -
 * Pins          100       64        100       64        100       64        100      64       100     64
 * No. PIOs      79        47        79        47        79        47        79       47       79      47
 * Ext. BUS      Yes       No        Yes       No        Yes       No        Yes      No       Yes     No
 * 12-bit ADC    16 ch     11 ch     16 ch     11 ch     16 ch     11 ch     16 ch    11 ch    16 ch   11 ch
 * 12-bit DAC    2 ch      2 ch      2 ch      2 ch      2 ch      2 ch      2 ch     2 ch     2 ch    2 ch
 * Timer Counter 6 ch      3 ch      6 ch      3 ch      6 ch      3 ch      6 ch     3 ch     6 ch    3 ch
 * PDC           22 ch     22 ch     22 ch     22 ch     22 ch     22 ch     22 ch    22 ch    22 ch   22 ch
 * USART         2         2         2         2         2         2         2        2        2       2
 * UART          2         2         2         2         2         2         2        2        2       2
 * HSMCI         Yes       Yes       Yes       Yes       Yes       Yes      Yes      Yes      Yes      Yes
 */

