apache/nuttx/arch/arm/include/sam34/chip.h
#  define SAM34_FLASH_SIZE           (1024*1024)   /* 1024KB */
#  define SAM34_SRAM0_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMAC Channels */
#  define SAM34_NPDCCHAN              24           /* 24 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM4E8E)
/* Internal memory */

#  define SAM34_FLASH_SIZE           (512*1024)    /* 512KB */
#  define SAM34_SRAM0_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMAC Channels */
#  define SAM34_NPDCCHAN              24           /* 24 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM4E16C)
/* Internal memory */

#  define SAM34_FLASH_SIZE           (1024*1024)   /* 1024KB */
#  define SAM34_SRAM0_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMAC Channels */
#  define SAM34_NPDCCHAN              21           /* 21 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#elif defined(CONFIG_ARCH_CHIP_ATSAM4E8C)
/* Internal memory */

#  define SAM34_FLASH_SIZE           (512*1024)    /* 512KB */
#  define SAM34_SRAM0_SIZE           (128*1024)    /* 128KB */
#  define SAM34_SRAM1_SIZE           0             /* None */
#  define SAM34_NFCSRAM_SIZE         0             /* None */

/* Peripherals */

#  define SAM34_NDMACHAN              4            /* 4 DMAC Channels */
#  define SAM34_NPDCCHAN              21           /* 21 PDC Channels */
#  define SAM34_NMCI2                 1            /* 1 memory card interface */
#  define SAM34_NSLCD                 0            /* No segment LCD interface */
#  define SAM34_NAESA                 0            /* No advanced encryption standard */
#  define SAM34_NUDPHS                0            /* No USB high speed device */
#  define SAM34_NUHPHS                0            /* No USB high speed embedded host */
#  define SAM34_NUDPFS                1            /* 1 USB full speed device */
#  define SAM34_NUHPFS                0            /* No USB full speed embedded host */

#else
#  error "Unknown SAM3/4 chip type"
#endif

/* NVIC priority levels *************************************************************/
/* Each priority field holds a priority value, 0-15. The lower the value, the greater
 * the priority of the corresponding interrupt. The processor implements only
 * bits[7:4] of each field, bits[3:0] read as zero and ignore writes.
 */

#define NVIC_SYSH_PRIORITY_MIN       0xf0 /* All bits[7:4] set is minimum priority */
#define NVIC_SYSH_PRIORITY_DEFAULT   0x80 /* Midpoint is the default */
#define NVIC_SYSH_PRIORITY_MAX       0x00 /* Zero is maximum priority */
#define NVIC_SYSH_PRIORITY_STEP      0x10 /* Four bits of interrupt priority used */

/* If CONFIG_ARMV7M_USEBASEPRI is selected, then interrupts will be disabled
 * by setting the BASEPRI register to NVIC_SYSH_DISABLE_PRIORITY so that most
 * interrupts will not have execution priority.  SVCall must have execution
 * priority in all cases.
 *
 * In the normal cases, interrupts are not nest-able and all interrupts run
 * at an execution priority between NVIC_SYSH_PRIORITY_MIN and
 * NVIC_SYSH_PRIORITY_MAX (with NVIC_SYSH_PRIORITY_MAX reserved for SVCall).
 *
 * If, in addition, CONFIG_ARCH_HIPRI_INTERRUPT is defined, then special
 * high priority interrupts are supported.  These are not "nested" in the
 * normal sense of the word.  These high priority interrupts can interrupt
 * normal processing but execute outside of OS (although they can "get back
 * into the game" via a PendSV interrupt).
 *
 * In the normal course of things, interrupts must occasionally be disabled
 * using the irqsave() inline function to prevent contention in use of
 * resources that may be shared between interrupt level and non-interrupt
 * level logic.  Now the question arises, if CONFIG_ARCH_HIPRI_INTERRUPT,
 * do we disable all interrupts (except SVCall), or do we only disable the
 * "normal" interrupts.  Since the high priority interrupts cannot interact
 * with the OS, you may want to permit the high priority interrupts even if
 * interrupts are disabled.  The setting CONFIG_ARCH_INT_DISABLEALL can be
 * used to select either behavior:
 *
 *   ----------------------------+--------------+----------------------------
 *   CONFIG_ARCH_HIPRI_INTERRUPT |      NO      |             YES
 *   ----------------------------+--------------+--------------+-------------
 *   CONFIG_ARCH_INT_DISABLEALL  |     N/A      |     YES      |      NO
 *   ----------------------------+--------------+--------------+-------------
 *                               |              |              |    SVCall
 *                               |    SVCall    |    SVCall    |    HIGH
 *   Disable here and below --------> MAXNORMAL ---> HIGH --------> MAXNORMAL
 *                               |              |    MAXNORMAL |
 *   ----------------------------+--------------+--------------+-------------
 */

#if defined(CONFIG_ARCH_HIPRI_INTERRUPT) && defined(CONFIG_ARCH_INT_DISABLEALL)
#  define NVIC_SYSH_MAXNORMAL_PRIORITY  (NVIC_SYSH_PRIORITY_MAX + 2*NVIC_SYSH_PRIORITY_STEP)
#  define NVIC_SYSH_HIGH_PRIORITY       (NVIC_SYSH_PRIORITY_MAX + NVIC_SYSH_PRIORITY_STEP)
#  define NVIC_SYSH_DISABLE_PRIORITY    NVIC_SYSH_HIGH_PRIORITY
#  define NVIC_SYSH_SVCALL_PRIORITY     NVIC_SYSH_PRIORITY_MAX
#else
#  define NVIC_SYSH_MAXNORMAL_PRIORITY  (NVIC_SYSH_PRIORITY_MAX + NVIC_SYSH_PRIORITY_STEP)
#  define NVIC_SYSH_HIGH_PRIORITY       NVIC_SYSH_PRIORITY_MAX
#  define NVIC_SYSH_DISABLE_PRIORITY    NVIC_SYSH_MAXNORMAL_PRIORITY
#  define NVIC_SYSH_SVCALL_PRIORITY     NVIC_SYSH_PRIORITY_MAX
#endif

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_INCLUDE_SAM34_CHIP_H */
